###################################################################

# Created by write_sdc on Sun Dec 29 22:58:48 2024

###################################################################
set sdc_version 2.1

set_units -time ps -resistance kOhm -capacitance fF -voltage V -current mA
set_load -pin_load 0.05 [get_ports out_valid]
set_load -pin_load 0.05 [get_ports {Output[12]}]
set_load -pin_load 0.05 [get_ports {Output[11]}]
set_load -pin_load 0.05 [get_ports {Output[10]}]
set_load -pin_load 0.05 [get_ports {Output[9]}]
set_load -pin_load 0.05 [get_ports {Output[8]}]
set_load -pin_load 0.05 [get_ports {Output[7]}]
set_load -pin_load 0.05 [get_ports {Output[6]}]
set_load -pin_load 0.05 [get_ports {Output[5]}]
set_load -pin_load 0.05 [get_ports {Output[4]}]
set_load -pin_load 0.05 [get_ports {Output[3]}]
set_load -pin_load 0.05 [get_ports {Output[2]}]
set_load -pin_load 0.05 [get_ports {Output[1]}]
set_load -pin_load 0.05 [get_ports {Output[0]}]
set_ideal_network -no_propagate  [get_ports clk]
create_clock [get_ports clk]  -period 1500  -waveform {0 750}
set_input_delay -clock clk  0  [get_ports clk]
set_input_delay -clock clk  0  [get_ports rst_n]
set_input_delay -clock clk  750  [get_ports {Input_1[3]}]
set_input_delay -clock clk  750  [get_ports {Input_1[2]}]
set_input_delay -clock clk  750  [get_ports {Input_1[1]}]
set_input_delay -clock clk  750  [get_ports {Input_1[0]}]
set_input_delay -clock clk  750  [get_ports {Input_2[3]}]
set_input_delay -clock clk  750  [get_ports {Input_2[2]}]
set_input_delay -clock clk  750  [get_ports {Input_2[1]}]
set_input_delay -clock clk  750  [get_ports {Input_2[0]}]
set_input_delay -clock clk  750  [get_ports {Input_3[3]}]
set_input_delay -clock clk  750  [get_ports {Input_3[2]}]
set_input_delay -clock clk  750  [get_ports {Input_3[1]}]
set_input_delay -clock clk  750  [get_ports {Input_3[0]}]
set_input_delay -clock clk  750  [get_ports {Input_4[3]}]
set_input_delay -clock clk  750  [get_ports {Input_4[2]}]
set_input_delay -clock clk  750  [get_ports {Input_4[1]}]
set_input_delay -clock clk  750  [get_ports {Input_4[0]}]
set_input_delay -clock clk  750  [get_ports {Input_5[3]}]
set_input_delay -clock clk  750  [get_ports {Input_5[2]}]
set_input_delay -clock clk  750  [get_ports {Input_5[1]}]
set_input_delay -clock clk  750  [get_ports {Input_5[0]}]
set_input_delay -clock clk  750  [get_ports {Input_6[3]}]
set_input_delay -clock clk  750  [get_ports {Input_6[2]}]
set_input_delay -clock clk  750  [get_ports {Input_6[1]}]
set_input_delay -clock clk  750  [get_ports {Input_6[0]}]
set_input_delay -clock clk  750  [get_ports {Input_7[3]}]
set_input_delay -clock clk  750  [get_ports {Input_7[2]}]
set_input_delay -clock clk  750  [get_ports {Input_7[1]}]
set_input_delay -clock clk  750  [get_ports {Input_7[0]}]
set_input_delay -clock clk  750  [get_ports {Input_8[3]}]
set_input_delay -clock clk  750  [get_ports {Input_8[2]}]
set_input_delay -clock clk  750  [get_ports {Input_8[1]}]
set_input_delay -clock clk  750  [get_ports {Input_8[0]}]
set_input_delay -clock clk  750  [get_ports {Input_9[3]}]
set_input_delay -clock clk  750  [get_ports {Input_9[2]}]
set_input_delay -clock clk  750  [get_ports {Input_9[1]}]
set_input_delay -clock clk  750  [get_ports {Input_9[0]}]
set_input_delay -clock clk  750  [get_ports {Input_10[3]}]
set_input_delay -clock clk  750  [get_ports {Input_10[2]}]
set_input_delay -clock clk  750  [get_ports {Input_10[1]}]
set_input_delay -clock clk  750  [get_ports {Input_10[0]}]
set_input_delay -clock clk  750  [get_ports {Input_11[3]}]
set_input_delay -clock clk  750  [get_ports {Input_11[2]}]
set_input_delay -clock clk  750  [get_ports {Input_11[1]}]
set_input_delay -clock clk  750  [get_ports {Input_11[0]}]
set_input_delay -clock clk  750  [get_ports {Input_12[3]}]
set_input_delay -clock clk  750  [get_ports {Input_12[2]}]
set_input_delay -clock clk  750  [get_ports {Input_12[1]}]
set_input_delay -clock clk  750  [get_ports {Input_12[0]}]
set_input_delay -clock clk  750  [get_ports {Input_13[3]}]
set_input_delay -clock clk  750  [get_ports {Input_13[2]}]
set_input_delay -clock clk  750  [get_ports {Input_13[1]}]
set_input_delay -clock clk  750  [get_ports {Input_13[0]}]
set_input_delay -clock clk  750  [get_ports {Input_14[3]}]
set_input_delay -clock clk  750  [get_ports {Input_14[2]}]
set_input_delay -clock clk  750  [get_ports {Input_14[1]}]
set_input_delay -clock clk  750  [get_ports {Input_14[0]}]
set_input_delay -clock clk  750  [get_ports {Input_15[3]}]
set_input_delay -clock clk  750  [get_ports {Input_15[2]}]
set_input_delay -clock clk  750  [get_ports {Input_15[1]}]
set_input_delay -clock clk  750  [get_ports {Input_15[0]}]
set_input_delay -clock clk  750  [get_ports {Input_16[3]}]
set_input_delay -clock clk  750  [get_ports {Input_16[2]}]
set_input_delay -clock clk  750  [get_ports {Input_16[1]}]
set_input_delay -clock clk  750  [get_ports {Input_16[0]}]
set_input_delay -clock clk  750  [get_ports {Input_17[3]}]
set_input_delay -clock clk  750  [get_ports {Input_17[2]}]
set_input_delay -clock clk  750  [get_ports {Input_17[1]}]
set_input_delay -clock clk  750  [get_ports {Input_17[0]}]
set_input_delay -clock clk  750  [get_ports {Input_18[3]}]
set_input_delay -clock clk  750  [get_ports {Input_18[2]}]
set_input_delay -clock clk  750  [get_ports {Input_18[1]}]
set_input_delay -clock clk  750  [get_ports {Input_18[0]}]
set_input_delay -clock clk  750  [get_ports {Input_19[3]}]
set_input_delay -clock clk  750  [get_ports {Input_19[2]}]
set_input_delay -clock clk  750  [get_ports {Input_19[1]}]
set_input_delay -clock clk  750  [get_ports {Input_19[0]}]
set_input_delay -clock clk  750  [get_ports {Input_20[3]}]
set_input_delay -clock clk  750  [get_ports {Input_20[2]}]
set_input_delay -clock clk  750  [get_ports {Input_20[1]}]
set_input_delay -clock clk  750  [get_ports {Input_20[0]}]
set_input_delay -clock clk  750  [get_ports {Input_21[3]}]
set_input_delay -clock clk  750  [get_ports {Input_21[2]}]
set_input_delay -clock clk  750  [get_ports {Input_21[1]}]
set_input_delay -clock clk  750  [get_ports {Input_21[0]}]
set_input_delay -clock clk  750  [get_ports {Input_22[3]}]
set_input_delay -clock clk  750  [get_ports {Input_22[2]}]
set_input_delay -clock clk  750  [get_ports {Input_22[1]}]
set_input_delay -clock clk  750  [get_ports {Input_22[0]}]
set_input_delay -clock clk  750  [get_ports {Input_23[3]}]
set_input_delay -clock clk  750  [get_ports {Input_23[2]}]
set_input_delay -clock clk  750  [get_ports {Input_23[1]}]
set_input_delay -clock clk  750  [get_ports {Input_23[0]}]
set_input_delay -clock clk  750  [get_ports {Input_24[3]}]
set_input_delay -clock clk  750  [get_ports {Input_24[2]}]
set_input_delay -clock clk  750  [get_ports {Input_24[1]}]
set_input_delay -clock clk  750  [get_ports {Input_24[0]}]
set_input_delay -clock clk  750  [get_ports {Input_25[3]}]
set_input_delay -clock clk  750  [get_ports {Input_25[2]}]
set_input_delay -clock clk  750  [get_ports {Input_25[1]}]
set_input_delay -clock clk  750  [get_ports {Input_25[0]}]
set_input_delay -clock clk  750  [get_ports {Input_26[3]}]
set_input_delay -clock clk  750  [get_ports {Input_26[2]}]
set_input_delay -clock clk  750  [get_ports {Input_26[1]}]
set_input_delay -clock clk  750  [get_ports {Input_26[0]}]
set_input_delay -clock clk  750  [get_ports {Input_27[3]}]
set_input_delay -clock clk  750  [get_ports {Input_27[2]}]
set_input_delay -clock clk  750  [get_ports {Input_27[1]}]
set_input_delay -clock clk  750  [get_ports {Input_27[0]}]
set_input_delay -clock clk  750  [get_ports {Input_28[3]}]
set_input_delay -clock clk  750  [get_ports {Input_28[2]}]
set_input_delay -clock clk  750  [get_ports {Input_28[1]}]
set_input_delay -clock clk  750  [get_ports {Input_28[0]}]
set_input_delay -clock clk  750  [get_ports {Input_29[3]}]
set_input_delay -clock clk  750  [get_ports {Input_29[2]}]
set_input_delay -clock clk  750  [get_ports {Input_29[1]}]
set_input_delay -clock clk  750  [get_ports {Input_29[0]}]
set_input_delay -clock clk  750  [get_ports {Input_30[3]}]
set_input_delay -clock clk  750  [get_ports {Input_30[2]}]
set_input_delay -clock clk  750  [get_ports {Input_30[1]}]
set_input_delay -clock clk  750  [get_ports {Input_30[0]}]
set_input_delay -clock clk  750  [get_ports {Input_31[3]}]
set_input_delay -clock clk  750  [get_ports {Input_31[2]}]
set_input_delay -clock clk  750  [get_ports {Input_31[1]}]
set_input_delay -clock clk  750  [get_ports {Input_31[0]}]
set_input_delay -clock clk  750  [get_ports {Input_32[3]}]
set_input_delay -clock clk  750  [get_ports {Input_32[2]}]
set_input_delay -clock clk  750  [get_ports {Input_32[1]}]
set_input_delay -clock clk  750  [get_ports {Input_32[0]}]
set_output_delay -clock clk  750  [get_ports out_valid]
set_output_delay -clock clk  750  [get_ports {Output[12]}]
set_output_delay -clock clk  750  [get_ports {Output[11]}]
set_output_delay -clock clk  750  [get_ports {Output[10]}]
set_output_delay -clock clk  750  [get_ports {Output[9]}]
set_output_delay -clock clk  750  [get_ports {Output[8]}]
set_output_delay -clock clk  750  [get_ports {Output[7]}]
set_output_delay -clock clk  750  [get_ports {Output[6]}]
set_output_delay -clock clk  750  [get_ports {Output[5]}]
set_output_delay -clock clk  750  [get_ports {Output[4]}]
set_output_delay -clock clk  750  [get_ports {Output[3]}]
set_output_delay -clock clk  750  [get_ports {Output[2]}]
set_output_delay -clock clk  750  [get_ports {Output[1]}]
set_output_delay -clock clk  750  [get_ports {Output[0]}]
